Lasttests/k6_work_services.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 600000 iterations shared among 1000 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 1000/1000 VUs, 2043 complete and 0 interrupted iterations
default   [   0% ] 1000 VUs  00m01.0s/10m0s  002044/600000 shared iters

running (00m02.0s), 1000/1000 VUs, 5530 complete and 0 interrupted iterations
default   [   1% ] 1000 VUs  00m02.0s/10m0s  005530/600000 shared iters

running (00m03.0s), 1000/1000 VUs, 9547 complete and 0 interrupted iterations
default   [   2% ] 1000 VUs  00m03.0s/10m0s  009547/600000 shared iters

running (00m04.0s), 1000/1000 VUs, 14554 complete and 0 interrupted iterations
default   [   2% ] 1000 VUs  00m04.0s/10m0s  014554/600000 shared iters

running (00m05.0s), 1000/1000 VUs, 20074 complete and 0 interrupted iterations
default   [   3% ] 1000 VUs  00m05.0s/10m0s  020074/600000 shared iters

running (00m06.0s), 1000/1000 VUs, 26756 complete and 0 interrupted iterations
default   [   4% ] 1000 VUs  00m06.0s/10m0s  026756/600000 shared iters

running (00m07.0s), 1000/1000 VUs, 33128 complete and 0 interrupted iterations
default   [   6% ] 1000 VUs  00m07.0s/10m0s  033128/600000 shared iters

running (00m08.0s), 1000/1000 VUs, 39068 complete and 0 interrupted iterations
default   [   7% ] 1000 VUs  00m08.0s/10m0s  039068/600000 shared iters

running (00m09.0s), 1000/1000 VUs, 45514 complete and 0 interrupted iterations
default   [   8% ] 1000 VUs  00m09.0s/10m0s  045514/600000 shared iters

running (00m10.0s), 1000/1000 VUs, 52053 complete and 0 interrupted iterations
default   [   9% ] 1000 VUs  00m10.0s/10m0s  052053/600000 shared iters

running (00m11.0s), 1000/1000 VUs, 58540 complete and 0 interrupted iterations
default   [  10% ] 1000 VUs  00m11.0s/10m0s  058540/600000 shared iters

running (00m12.0s), 1000/1000 VUs, 65208 complete and 0 interrupted iterations
default   [  11% ] 1000 VUs  00m12.0s/10m0s  065208/600000 shared iters

running (00m13.0s), 1000/1000 VUs, 71443 complete and 0 interrupted iterations
default   [  12% ] 1000 VUs  00m13.0s/10m0s  071443/600000 shared iters

running (00m14.0s), 1000/1000 VUs, 77859 complete and 0 interrupted iterations
default   [  13% ] 1000 VUs  00m14.0s/10m0s  077859/600000 shared iters

running (00m15.0s), 1000/1000 VUs, 84217 complete and 0 interrupted iterations
default   [  14% ] 1000 VUs  00m15.0s/10m0s  084217/600000 shared iters

running (00m16.0s), 1000/1000 VUs, 90449 complete and 0 interrupted iterations
default   [  15% ] 1000 VUs  00m16.0s/10m0s  090462/600000 shared iters

running (00m17.0s), 1000/1000 VUs, 96723 complete and 0 interrupted iterations
default   [  16% ] 1000 VUs  00m17.0s/10m0s  096723/600000 shared iters

running (00m18.0s), 1000/1000 VUs, 103299 complete and 0 interrupted iterations
default   [  17% ] 1000 VUs  00m18.0s/10m0s  103299/600000 shared iters

running (00m19.0s), 1000/1000 VUs, 110031 complete and 0 interrupted iterations
default   [  18% ] 1000 VUs  00m19.0s/10m0s  110035/600000 shared iters

running (00m20.0s), 1000/1000 VUs, 116719 complete and 0 interrupted iterations
default   [  19% ] 1000 VUs  00m20.0s/10m0s  116719/600000 shared iters

running (00m21.0s), 1000/1000 VUs, 122207 complete and 0 interrupted iterations
default   [  20% ] 1000 VUs  00m21.0s/10m0s  122207/600000 shared iters

running (00m22.0s), 1000/1000 VUs, 127777 complete and 0 interrupted iterations
default   [  21% ] 1000 VUs  00m22.0s/10m0s  127777/600000 shared iters

running (00m23.0s), 1000/1000 VUs, 132064 complete and 0 interrupted iterations
default   [  22% ] 1000 VUs  00m23.0s/10m0s  132064/600000 shared iters

running (00m24.0s), 1000/1000 VUs, 138275 complete and 0 interrupted iterations
default   [  23% ] 1000 VUs  00m24.0s/10m0s  138275/600000 shared iters

running (00m25.0s), 1000/1000 VUs, 144533 complete and 0 interrupted iterations
default   [  24% ] 1000 VUs  00m25.0s/10m0s  144533/600000 shared iters

running (00m26.0s), 1000/1000 VUs, 149422 complete and 0 interrupted iterations
default   [  25% ] 1000 VUs  00m26.0s/10m0s  149422/600000 shared iters

running (00m27.0s), 1000/1000 VUs, 155149 complete and 0 interrupted iterations
default   [  26% ] 1000 VUs  00m27.0s/10m0s  155150/600000 shared iters

running (00m28.0s), 1000/1000 VUs, 161628 complete and 0 interrupted iterations
default   [  27% ] 1000 VUs  00m28.0s/10m0s  161628/600000 shared iters

running (00m29.0s), 1000/1000 VUs, 167236 complete and 0 interrupted iterations
default   [  28% ] 1000 VUs  00m29.0s/10m0s  167236/600000 shared iters

running (00m30.0s), 1000/1000 VUs, 172910 complete and 0 interrupted iterations
default   [  29% ] 1000 VUs  00m30.0s/10m0s  172910/600000 shared iters

running (00m31.0s), 1000/1000 VUs, 178626 complete and 0 interrupted iterations
default   [  30% ] 1000 VUs  00m31.0s/10m0s  178626/600000 shared iters

running (00m32.0s), 1000/1000 VUs, 184997 complete and 0 interrupted iterations
default   [  31% ] 1000 VUs  00m32.0s/10m0s  184997/600000 shared iters

running (00m33.0s), 1000/1000 VUs, 191456 complete and 0 interrupted iterations
default   [  32% ] 1000 VUs  00m33.0s/10m0s  191456/600000 shared iters

running (00m34.0s), 1000/1000 VUs, 197583 complete and 0 interrupted iterations
default   [  33% ] 1000 VUs  00m34.0s/10m0s  197583/600000 shared iters

running (00m35.0s), 1000/1000 VUs, 203607 complete and 0 interrupted iterations
default   [  34% ] 1000 VUs  00m35.0s/10m0s  203607/600000 shared iters

running (00m36.0s), 1000/1000 VUs, 209448 complete and 0 interrupted iterations
default   [  35% ] 1000 VUs  00m36.0s/10m0s  209448/600000 shared iters

running (00m37.0s), 1000/1000 VUs, 216156 complete and 0 interrupted iterations
default   [  36% ] 1000 VUs  00m37.0s/10m0s  216156/600000 shared iters

running (00m38.0s), 1000/1000 VUs, 222796 complete and 0 interrupted iterations
default   [  37% ] 1000 VUs  00m38.0s/10m0s  222796/600000 shared iters

running (00m39.0s), 1000/1000 VUs, 229164 complete and 0 interrupted iterations
default   [  38% ] 1000 VUs  00m39.0s/10m0s  229168/600000 shared iters

running (00m40.0s), 1000/1000 VUs, 235691 complete and 0 interrupted iterations
default   [  39% ] 1000 VUs  00m40.0s/10m0s  235691/600000 shared iters

running (00m41.0s), 1000/1000 VUs, 242523 complete and 0 interrupted iterations
default   [  40% ] 1000 VUs  00m41.0s/10m0s  242523/600000 shared iters

running (00m42.0s), 1000/1000 VUs, 249163 complete and 0 interrupted iterations
default   [  42% ] 1000 VUs  00m42.0s/10m0s  249163/600000 shared iters

running (00m43.0s), 1000/1000 VUs, 255594 complete and 0 interrupted iterations
default   [  43% ] 1000 VUs  00m43.0s/10m0s  255594/600000 shared iters

running (00m44.0s), 1000/1000 VUs, 261983 complete and 0 interrupted iterations
default   [  44% ] 1000 VUs  00m44.0s/10m0s  261984/600000 shared iters

running (00m45.0s), 1000/1000 VUs, 266419 complete and 0 interrupted iterations
default   [  44% ] 1000 VUs  00m45.0s/10m0s  266419/600000 shared iters

running (00m46.0s), 1000/1000 VUs, 272154 complete and 0 interrupted iterations
default   [  45% ] 1000 VUs  00m46.0s/10m0s  272154/600000 shared iters

running (00m47.0s), 1000/1000 VUs, 278315 complete and 0 interrupted iterations
default   [  46% ] 1000 VUs  00m47.0s/10m0s  278315/600000 shared iters

running (00m48.0s), 1000/1000 VUs, 284958 complete and 0 interrupted iterations
default   [  47% ] 1000 VUs  00m48.0s/10m0s  284959/600000 shared iters

running (00m49.0s), 1000/1000 VUs, 291521 complete and 0 interrupted iterations
default   [  49% ] 1000 VUs  00m49.0s/10m0s  291521/600000 shared iters

running (00m50.0s), 1000/1000 VUs, 297756 complete and 0 interrupted iterations
default   [  50% ] 1000 VUs  00m50.0s/10m0s  297756/600000 shared iters

running (00m51.0s), 1000/1000 VUs, 303649 complete and 0 interrupted iterations
default   [  51% ] 1000 VUs  00m51.0s/10m0s  303649/600000 shared iters

running (00m52.0s), 1000/1000 VUs, 309289 complete and 0 interrupted iterations
default   [  52% ] 1000 VUs  00m52.0s/10m0s  309289/600000 shared iters

running (00m53.0s), 1000/1000 VUs, 314929 complete and 0 interrupted iterations
default   [  52% ] 1000 VUs  00m53.0s/10m0s  314929/600000 shared iters

running (00m54.0s), 1000/1000 VUs, 321088 complete and 0 interrupted iterations
default   [  54% ] 1000 VUs  00m54.0s/10m0s  321088/600000 shared iters

running (00m55.0s), 1000/1000 VUs, 327764 complete and 0 interrupted iterations
default   [  55% ] 1000 VUs  00m55.0s/10m0s  327764/600000 shared iters

running (00m56.0s), 1000/1000 VUs, 334350 complete and 0 interrupted iterations
default   [  56% ] 1000 VUs  00m56.0s/10m0s  334350/600000 shared iters

running (00m57.0s), 1000/1000 VUs, 340713 complete and 0 interrupted iterations
default   [  57% ] 1000 VUs  00m57.0s/10m0s  340713/600000 shared iters

running (00m58.0s), 1000/1000 VUs, 347415 complete and 0 interrupted iterations
default   [  58% ] 1000 VUs  00m58.0s/10m0s  347416/600000 shared iters

running (00m59.0s), 1000/1000 VUs, 353865 complete and 0 interrupted iterations
default   [  59% ] 1000 VUs  00m59.0s/10m0s  353865/600000 shared iters

running (01m00.0s), 1000/1000 VUs, 360213 complete and 0 interrupted iterations
default   [  60% ] 1000 VUs  01m00.0s/10m0s  360213/600000 shared iters

running (01m01.0s), 1000/1000 VUs, 366950 complete and 0 interrupted iterations
default   [  61% ] 1000 VUs  01m01.0s/10m0s  366951/600000 shared iters

running (01m02.0s), 1000/1000 VUs, 372641 complete and 0 interrupted iterations
default   [  62% ] 1000 VUs  01m02.0s/10m0s  372641/600000 shared iters

running (01m03.0s), 1000/1000 VUs, 379104 complete and 0 interrupted iterations
default   [  63% ] 1000 VUs  01m03.0s/10m0s  379104/600000 shared iters

running (01m04.0s), 1000/1000 VUs, 385631 complete and 0 interrupted iterations
default   [  64% ] 1000 VUs  01m04.0s/10m0s  385631/600000 shared iters

running (01m05.0s), 1000/1000 VUs, 392155 complete and 0 interrupted iterations
default   [  65% ] 1000 VUs  01m05.0s/10m0s  392155/600000 shared iters

running (01m06.0s), 1000/1000 VUs, 398920 complete and 0 interrupted iterations
default   [  66% ] 1000 VUs  01m06.0s/10m0s  398920/600000 shared iters

running (01m07.0s), 1000/1000 VUs, 403847 complete and 0 interrupted iterations
default   [  67% ] 1000 VUs  01m07.0s/10m0s  403847/600000 shared iters

running (01m08.0s), 1000/1000 VUs, 408078 complete and 0 interrupted iterations
default   [  68% ] 1000 VUs  01m08.0s/10m0s  408078/600000 shared iters

running (01m09.0s), 1000/1000 VUs, 414028 complete and 0 interrupted iterations
default   [  69% ] 1000 VUs  01m09.0s/10m0s  414028/600000 shared iters

running (01m10.0s), 1000/1000 VUs, 419427 complete and 0 interrupted iterations
default   [  70% ] 1000 VUs  01m10.0s/10m0s  419427/600000 shared iters

running (01m11.0s), 1000/1000 VUs, 425398 complete and 0 interrupted iterations
default   [  71% ] 1000 VUs  01m11.0s/10m0s  425398/600000 shared iters

running (01m12.0s), 1000/1000 VUs, 431615 complete and 0 interrupted iterations
default   [  72% ] 1000 VUs  01m12.0s/10m0s  431616/600000 shared iters

running (01m13.0s), 1000/1000 VUs, 437973 complete and 0 interrupted iterations
default   [  73% ] 1000 VUs  01m13.0s/10m0s  437973/600000 shared iters

running (01m14.0s), 1000/1000 VUs, 444074 complete and 0 interrupted iterations
default   [  74% ] 1000 VUs  01m14.0s/10m0s  444074/600000 shared iters

running (01m15.0s), 1000/1000 VUs, 450138 complete and 0 interrupted iterations
default   [  75% ] 1000 VUs  01m15.0s/10m0s  450138/600000 shared iters

running (01m16.0s), 1000/1000 VUs, 456539 complete and 0 interrupted iterations
default   [  76% ] 1000 VUs  01m16.0s/10m0s  456539/600000 shared iters

running (01m17.0s), 1000/1000 VUs, 463324 complete and 0 interrupted iterations
default   [  77% ] 1000 VUs  01m17.0s/10m0s  463324/600000 shared iters

running (01m18.0s), 1000/1000 VUs, 469391 complete and 0 interrupted iterations
default   [  78% ] 1000 VUs  01m18.0s/10m0s  469391/600000 shared iters

running (01m19.0s), 1000/1000 VUs, 475656 complete and 0 interrupted iterations
default   [  79% ] 1000 VUs  01m19.0s/10m0s  475656/600000 shared iters

running (01m20.0s), 1000/1000 VUs, 482090 complete and 0 interrupted iterations
default   [  80% ] 1000 VUs  01m20.0s/10m0s  482091/600000 shared iters

running (01m21.0s), 1000/1000 VUs, 488811 complete and 0 interrupted iterations
default   [  81% ] 1000 VUs  01m21.0s/10m0s  488811/600000 shared iters

running (01m22.0s), 1000/1000 VUs, 494513 complete and 0 interrupted iterations
default   [  82% ] 1000 VUs  01m22.0s/10m0s  494513/600000 shared iters

running (01m23.0s), 1000/1000 VUs, 500849 complete and 0 interrupted iterations
default   [  83% ] 1000 VUs  01m23.0s/10m0s  500851/600000 shared iters

running (01m24.0s), 1000/1000 VUs, 507805 complete and 0 interrupted iterations
default   [  85% ] 1000 VUs  01m24.0s/10m0s  507805/600000 shared iters

running (01m25.0s), 1000/1000 VUs, 514070 complete and 0 interrupted iterations
default   [  86% ] 1000 VUs  01m25.0s/10m0s  514070/600000 shared iters

running (01m26.0s), 1000/1000 VUs, 520761 complete and 0 interrupted iterations
default   [  87% ] 1000 VUs  01m26.0s/10m0s  520761/600000 shared iters

running (01m27.0s), 1000/1000 VUs, 527338 complete and 0 interrupted iterations
default   [  88% ] 1000 VUs  01m27.0s/10m0s  527339/600000 shared iters

running (01m28.0s), 1000/1000 VUs, 533685 complete and 0 interrupted iterations
default   [  89% ] 1000 VUs  01m28.0s/10m0s  533685/600000 shared iters

running (01m29.0s), 1000/1000 VUs, 539890 complete and 0 interrupted iterations
default   [  90% ] 1000 VUs  01m29.0s/10m0s  539890/600000 shared iters

running (01m30.0s), 1000/1000 VUs, 546529 complete and 0 interrupted iterations
default   [  91% ] 1000 VUs  01m30.0s/10m0s  546529/600000 shared iters

running (01m31.0s), 1000/1000 VUs, 551098 complete and 0 interrupted iterations
default   [  92% ] 1000 VUs  01m31.0s/10m0s  551098/600000 shared iters

running (01m32.0s), 1000/1000 VUs, 556791 complete and 0 interrupted iterations
default   [  93% ] 1000 VUs  01m32.0s/10m0s  556791/600000 shared iters

running (01m33.0s), 1000/1000 VUs, 563358 complete and 0 interrupted iterations
default   [  94% ] 1000 VUs  01m33.0s/10m0s  563358/600000 shared iters

running (01m34.0s), 1000/1000 VUs, 569745 complete and 0 interrupted iterations
default   [  95% ] 1000 VUs  01m34.0s/10m0s  569745/600000 shared iters

running (01m35.0s), 1000/1000 VUs, 576549 complete and 0 interrupted iterations
default   [  96% ] 1000 VUs  01m35.0s/10m0s  576558/600000 shared iters

running (01m36.0s), 1000/1000 VUs, 582951 complete and 0 interrupted iterations
default   [  97% ] 1000 VUs  01m36.0s/10m0s  582951/600000 shared iters

running (01m37.0s), 1000/1000 VUs, 589687 complete and 0 interrupted iterations
default   [  98% ] 1000 VUs  01m37.0s/10m0s  589688/600000 shared iters

running (01m38.0s), 1000/1000 VUs, 596154 complete and 0 interrupted iterations
default   [  99% ] 1000 VUs  01m38.0s/10m0s  596154/600000 shared iters

running (01m38.5s), 0000/1000 VUs, 600000 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  01m38.5s/10m0s  600000/600000 shared iters

     data_received..................: 68 MB  688 kB/s
     data_sent......................: 52 MB  530 kB/s
     http_req_blocked...............: avg=61.8µs   min=0s        med=1µs      max=230.31ms p(90)=2µs      p(95)=2µs     
     http_req_connecting............: avg=60.36µs  min=0s        med=0s       max=202.7ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=163.96ms min=12.46ms   med=156.12ms max=1.21s    p(90)=205.08ms p(95)=231.24ms
       { expected_response:true }...: avg=163.96ms min=12.46ms   med=156.12ms max=1.21s    p(90)=205.08ms p(95)=231.24ms
     http_req_failed................: 0.00%  ✓ 0           ✗ 600000
     http_req_receiving.............: avg=17.3µs   min=4µs       med=11µs     max=13.67ms  p(90)=25µs     p(95)=41µs    
     http_req_sending...............: avg=7.25µs   min=-433000ns med=3µs      max=27.87ms  p(90)=7µs      p(95)=11µs    
     http_req_tls_handshaking.......: avg=0s       min=0s        med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=163.94ms min=12.44ms   med=156.09ms max=1.21s    p(90)=205.05ms p(95)=231.22ms
     http_reqs......................: 600000 6090.772364/s
     iteration_duration.............: avg=164.06ms min=12.51ms   med=156.17ms max=1.23s    p(90)=205.16ms p(95)=231.46ms
     iterations.....................: 600000 6090.772364/s
     vus............................: 1000   min=1000      max=1000
     vus_max........................: 1000   min=1000      max=1000


running (01m38.5s), 0000/1000 VUs, 600000 complete and 0 interrupted iterations
default ✓ [ 100% ] 1000 VUs  01m38.5s/10m0s  600000/600000 shared iters

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: script.js
        output: -

     scenarios: (100.00%) 1 scenario, 600000 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 600000 iterations shared among 600000 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Init      [   4% ] 023582/600000 VUs initialized
default   [   0% ]

Init      [   8% ] 045776/600000 VUs initialized
default   [   0% ]

Init      [  12% ] 071905/600000 VUs initialized
default   [   0% ]

Init      [  14% ] 082643/600000 VUs initialized
default   [   0% ]

Init      [  15% ] 092555/600000 VUs initialized
default   [   0% ]

Init      [  19% ] 114947/600000 VUs initialized
default   [   0% ]

Init      [  23% ] 135207/600000 VUs initialized
default   [   0% ]

Init      [  24% ] 141974/600000 VUs initialized
default   [   0% ]

Init      [  25% ] 147936/600000 VUs initialized
default   [   0% ]

Init      [  26% ] 154308/600000 VUs initialized
default   [   0% ]

Init      [  28% ] 165592/600000 VUs initialized
default   [   0% ]

Init      [  29% ] 174518/600000 VUs initialized
default   [   0% ]

Init      [  31% ] 188881/600000 VUs initialized
default   [   0% ]

Init      [  35% ] 212279/600000 VUs initialized
default   [   0% ]

Init      [  40% ] 240582/600000 VUs initialized
default   [   0% ]

Init      [  42% ] 250162/600000 VUs initialized
default   [   0% ]

Init      [  43% ] 257463/600000 VUs initialized
default   [   0% ]

Init      [  44% ] 262074/600000 VUs initialized
default   [   0% ]

Init      [  44% ] 264545/600000 VUs initialized
default   [   0% ]

Init      [  45% ] 270497/600000 VUs initialized
default   [   0% ]

Init      [  46% ] 277325/600000 VUs initialized
default   [   0% ]

Init      [  47% ] 283303/600000 VUs initialized
default   [   0% ]

Init      [  48% ] 288869/600000 VUs initialized
default   [   0% ]

Init      [  49% ] 296616/600000 VUs initialized
default   [   0% ]

Init      [  51% ] 304489/600000 VUs initialized
default   [   0% ]

Init      [  52% ] 311908/600000 VUs initialized
default   [   0% ]

Init      [  53% ] 317068/600000 VUs initialized
default   [   0% ]

     vus.......: 0      min=0     max=0     
     vus_max...: 317077 min=23585 max=317077


Init      [  53% ] 318435/600000 VUs initialized
default   [   0% ]